/*
 * desc: 产品给的错误码表格中的错误描述信息（后端写的）
 * detail: 前端调整的提示
 * 注意：不要修改任何desc，如果desc写的不对就加一个detail
 */

let EVMCODE = {
    10001:{
        desc: '新建虚机调度策略异常'
    },
    10002:{
        desc: '更新虚机调度策略异常'
    },
    10003:{
        desc: '删除蓄积调度策略异常'
    },
    10004:{
        detail: '查询虚机调度策略异常',
        desc: '查询虚机调度策略（show根据id）异常'
    },
    10005:{
        detail: '查询虚机调度策略异常',
        desc: '查询蓄积调度策略（list列出全部）异常'
    },
    10101:{
        desc: '新建虚机模板异常'
    },
    10102:{
        desc: '更新虚机模板异常'
    },
    10103:{
        desc: '删除虚机模板异常'
    },
    10104:{
        detail: '查询虚机模板异常',
        desc: '查询虚机模板（show根据id）异常'
    },
    10105:{
        detail: '查询虚机模板异常',
        desc: '查询虚机模板（list列出全部）异常'
    },
    10106:{
        desc: '根据模板创建虚机模板异常'
    },
    10201:{
        desc: '创建虚机异常'
    },
    10202:{
        desc: '超出配额异常'
    },
    10203:{
        detail: '修改虚机规格异常',
        desc: '修改虚机flavor异常'
    },
    10204:{
        desc: '从虚机制作镜像异常'
    },
    10205:{
        desc: '虚机状态不在预计范围内'
    },
    10206:{
        detail: '没有匹配的虚机规格',
        desc: 'flavor无法与openstack内的匹配'
    },
    10207:{
        desc: '恢复虚机实例异常'
    },
    10208:{
        desc: '未知版本信息'
    },
    10209:{
        desc: '当前版本不支持此操作'
    },
    10210:{
        desc: '虚机回收站异常'
    },
    10211:{
        desc: '虚机列表查询线程异常'
    },
    10212:{
        desc: '虚机详情线程异常'
    },
    10213:{
        desc: '优化查询虚机详情异常'
    },
    10301:{
        desc: 'ssh错误'
    },
    10302:{
        desc: 'ssh超时'
    },
    10303:{
        desc: 'ssh登录失败'
    },
    10304:{
        desc: '服务名不合法'
    },
    10305:{
        desc: '客户端连接错误'
    },
    10401:{
        detail: '数据表找不到记录',
        desc: '数据表找不到记录异常'
    },
    10402:{
        desc: '调用后端状态码错误'
    },
    10403:{
        desc: '用户有子组不能删除'
    },
    10404:{
        desc: 'DomainName无法在profile表里找到相应配置信息'
    },
    10405:{
        desc: '连接ldap服务器失败'
    },
    10406:{
        desc: '该域下有用户或者用户组导入则不能删除'
    },
    20001:{
        desc: '创建浮动ip异常'
    },
    20002:{
        desc: '更新浮动ip异常'
    },
    20003:{
        desc: '删除浮动ip异常'
    },
    20004:{
        detail: '查询浮动ip异常',
        desc: '查询浮动ip（show根据id）异常'
    },
    20005:{
        detail: '查询浮动ip异常',
        desc: '查询浮动ip（list全部列出）异常'
    },
    20101:{
        desc: '创建网络异常'
    },
    20102:{
        desc: '更新网络异常'
    },
    20103:{
        desc: '删除网络异常'
    },
    20104:{
        detail: '查询网络异常[detail]',
        desc: '查询网络（show根据id）异常'
    },
    20105:{
        detail: '查询网络异常[list]',
        desc: '查询网络（list全部列出）异常'
    },
    20204:{
        detail: '查询网络ip可用性异常[detail]',
        desc: '查询网络ip可用（show根据id）'
    },
    20205:{
        detail: '查询网络ip可用性异常[list]',
        desc: '查询网络ip可用（list全部列出）'
    },
    20301:{
        desc: '创建网络限速异常'
    },
    20302:{
        desc: '更新网络限速异常'
    },
    20303:{
        desc: '删除网络限速异常'
    },
    20304:{
        detail: '查询网络限速异常[detail]',
        desc: '查询网络限速（show根据id）异常'
    },
    20305:{
        detail: '查询网络限速异常[list]',
        desc: '查询网络限速（list列出全部）异常'
    },
    20401:{
        desc: '创建端口异常'
    },
    20402:{
        desc: '更新端口异常'
    },
    20403:{
        desc: '删除端口异常'
    },
    20404:{
        detail: '查询端口异常[detail]',
        desc: '查询端口（show根据id）异常'
    },
    20405:{
        detail: '查询端口异常[list]',
        desc: '查询端口（list列出全部）异常'
    },
    20501:{
        desc: '创建路由异常'
    },
    20502:{
        desc: '更新路由异常'
    },
    20503:{
        desc: '删除路由异常'
    },
    20504:{
        detail: '查询路由异常[detail]',
        desc: '查询路由（show根据id）异常'
    },
    20505:{
        detail: '查询路由异常[list]',
        desc: '查询路由（list列出全部）异常'
    },
    20506:{
        detail: '增加路由接口异常',
        desc: '增加路由interface异常'
    },
    20507:{
        detail: '删除路由接口异常',
        desc: '删除路由interface异常'
    },
    20601:{
        desc: '创建子网异常'
    },
    20602:{
        desc: '更新子网异常'
    },
    20603:{
        desc: '删除子网异常'
    },
    20604:{
        detail: '查询子网异常[detail]',
        desc: '查询子网（show根据id）异常'
    },
    20605:{
        detail: '查询子网异常[list]',
        desc: '查询子网（list列出全部）异常'
    },
    30002:{
        desc: '更新镜像异常'
    },
    30003:{
        detail: '删除glance镜像异常',
        desc: '删除镜像（glance里面的）异常'
    },
    30007:{
        detail: '删除数据库镜像异常',
        desc: '删除镜像（数据库里面的）异常'
    },
    30004:{
        detail: '查询镜像异常',
        desc: '查询镜像（show根据id）异常'
    },
    30005:{
        detail: '查询镜像异常',
        desc: '查询镜像（list列出全部）异常'
    },
    30006:{
        desc: '上传镜像异常'
    },
    40001:{
        desc: '创建数据盘异常'
    },
    40002:{
        desc: '更新数据盘异常'
    },
    40003:{
        desc: '删除数据盘异常'
    },
    40004:{
        detail: '查询数据盘异常[detail]',
        desc: '查询数据盘（show根据id）异常'
    },
    40005:{
        detail: '查询数据盘异常[list]',
        desc: '查询数据盘（list列出全部）异常'
    },
    40006:{
        desc: '查询数据盘异常'
    },
    40007:{
        desc: '操作数据盘异常'
    },
    40101:{
        desc: '数据盘创建快照异常'
    },
    40102:{
        desc: '查询数据盘快照异常'
    },
    40103:{
        desc: '删除数据盘快照异常'
    },
    40201:{
        desc: '检验ip/path参数异常'
    },
    40202:{
        desc: '更新数据盘后端错误'
    },
    40203:{
        desc: '删除数据盘后端错误'
    },
    40204:{
        desc: '获取数据盘后端详情错误'
    },
    40205:{
        desc: '获取数据盘后端列表错误'
    },
    40206:{
        desc: '查询数据盘后端异常'
    },
    40207:{
        desc: '数据盘后端操作异常'
    },
    50001:{
        desc: '创建用户异常'
    },
    50002:{
        desc: '更新用户异常'
    },
    50003:{
        desc: '删除用户异常'
    },
    50004:{
        desc: '根据keystone_id查询不到用户异常'
    },
    50005:{
        detail: '根据code无法在用户表查到用户',
        desc: '根据code无法再用户表查到用户异常'
    },
    50006:{
        detail: '重置密码失败',
        desc: '重置密码'
    },
    50007:{
        desc: '用户角色分配给小组域失败'
    },
    50008:{
        detail: 'token校验失败',
        desc: '认证鉴权异常'
    },
    50101:{
        desc: '新建角色异常'
    },
    50102:{
        desc: '更新角色异常'
    },
    50201:{
        detail: '数据表找不到记录',
        desc: '数据表找不到记录异常'
    },
    50202:{
        desc: '调用后端状态码异常'
    },
    50203:{
        desc: '传入参数为空'
    },
    50204:{
        desc: '传入参数错误或不需传参'
    },
    50205:{
        desc: '传入参数已被占用'
    },
    50206:{
        desc: 'token过期'
    },
    60001:{
        desc: '更新os_quota配置异常'
    },
    60002:{
        desc: '查询os_quota配置异常'
    },
    60101:{
        desc: '创建profile异常'
    },
    60102:{
        desc: '更新profile异常'
    },
    60103:{
        desc: '删除profile异常'
    },
    60104:{
        detail: '查询profile异常[detail]',
        desc: '查询profile（show根据id）异常'
    },
    60105:{
        detail: '查询profile异常[list]',
        desc: '查询profile（list列出全部）异常'
    },
    60201:{
        desc: 'license版本不能倒退'
    },
    60202:{
        desc: '创建云存储异常'
    },
    60203:{
        desc: '集群已经有云存储，并且云存储命名方式和规定不一致'
    },
    60204:{
        desc: '检验失败'
    },
    70001:{
        desc: 'zabbix错误'
    },
    70002:{
        desc: '邮件发送异常'
    },
    70003:{
        detail: '找不到对应信息',
        desc: '找不到对应信息异常'
    },
    70004:{
        desc: '传入参数异常'
    },
    70005:{
        detail: '微信发送异常',
        desc: 'wechat发送异常'
    },
    70006:{
        desc: 'sms发送异常'
    },
    70101:{
        desc: '新建告警联系人异常'
    },
    70102:{
        desc: '更新告警联系人异常'
    },
    70103:{
        desc: '删除告警联系人异常'
    },
    70104:{
        detail: '查询告警联系人异常[list]',
        desc: '查询告警联系人（获取列表）异常'
    },
    70106:{
        detail: '查询告警联系人异常[detail]',
        desc: '查询告警联系人（获取详情）异常'
    },
    70107:{
        detail: '查询告警联系人异常[detail]',
        desc: '查询告警联系人（获取详情根据根据id）异常'
    },
    70201:{
        desc: '邮件发送失败'
    },
    70202:{
        desc: '更新邮件服务器异常'
    },
    70203:{
        desc: '查询邮件服务器失败'
    },
    70204:{
        desc: '告警邮件服务器已存在'
    },
    70205:{
        desc: '添加邮件服务器失败'
    },
    70301:{
        desc: '新建告警策略异常'
    },
    70302:{
        desc: '查询告警策略列表异常'
    },
    70303:{
        desc: '查询告警策略详情异常'
    },
    70304:{
        desc: '删除告警策略失败'
    },
    70305:{
        desc: '更新告警策略异常'
    },
    70306:{
        desc: '创建zabbix api client异常'
    },
    70307:{
        desc: '创建trigger与zabbix服务器同步异常'
    },
    70308:{
        desc: '删除trigger后同步删除zabbix的expression异常'
    },
    70309:{
        desc: '新建虚机或物理机后查询改机能否与zabbix server通信异常'
    },
    70310:{
        desc: '告警策略选择关联对象为全部时向openstack请求物理机信息异常'
    },
    70311:{
        desc: '告警策略选择为关联对象全部时向openstack请求所有虚机详情'
    },
    70401:{
        detail: '表中查找不到数据',
        desc: '表中查找不到数据异常'
    },
    70402:{
        desc: '传入参数为空'
    },
    70403:{
        desc: '没必要传入参数'
    },
    70404:{
        desc: '传入参数禁止进行某种操作'
    },
    70405:{
        desc: '传入参数已被占用'
    },
    80001:{
        detail: '存储token过期',
        desc: '凯翔token过期'
    },
    80002:{
        detail: '获取存储token异常',
        desc: '获取凯翔token异常'
    },
    80003:{
        desc: '查询存储信息异常'
    },
    80004:{
        desc: '查询设备性能异常'
    },
    80005:{
        desc: '查询集群id异常'
    },
    80101:{
        desc: '获取设备列表异常'
    },
    80102:{
        desc: '获取磁盘列表异常'
    },
    80103:{
        desc: '磁盘加入存储池异常'
    },
    80104:{
        desc: '创建卷异常'
    },
    80105:{
        desc: '获取卷列表异常'
    },
    80106:{
        desc: '获取卷详情异常'
    },
    80107:{
        desc: '卷扩容异常'
    },
    80108:{
        desc: '获取集群列表异常'
    },
    80109:{
        desc: '创建集群异常'
    },
    80110:{
        desc: '获取集群中已存在设备异常'
    },
    80111:{
        desc: '设备注册异常'
    },
    80112:{
        desc: '集群添加设备异常'
    },
    80113:{
        desc: '创建文件存储池异常'
    },
    80114:{
        desc: '查询文件存储池异常'
    },
    80115:{
        desc: '磁盘加入文件存储池错误'
    },
    80116:{
        desc: '获取文件存储池可用磁盘异常'
    },
    80117:{
        desc: '获取已加入文件存储池磁盘异常'
    },
    80118:{
        desc: '获取设备详情异常'
    }
}

let XVIEWCODE = {
    110001: {
        desc: '从表中获取数据失败异常'
    },
    110001: {
        desc: '从表中获取数据失败异常'
    },
    110001: {
        desc: '从表中获取数据失败异常'
    },
    110002: {
        desc: '获取终端列表异常'
    },
    110003: {
        desc: '发送消息到终端异常'
    },
    110004: {
        desc: '获取虚机metadata失败异常'
    },
    110005: {
        desc: '添加metadata失败异常'
    },
    110006: {
        desc: '获取虚机列表异常'
    },
    110101: {
        desc: '终端激活虚机失败'
    },
    110301: {
        desc: '获取用户列表异常'
    },
    110302: {
        desc: '获取池和组的关系异常'
    },
    110303: {
        desc: '获取池列表异常'
    },
    110304: {
        desc: '根据池id获取池内容异常'
    },
    110305: {
        desc: '获取用户列表异常'
    },
    110306: {
        desc: '获取池和虚机的关系异常'
    },
    110307: {
        desc: '获取用户和虚机的绑定关系异常'
    },
    130001: {
        desc: '新建桌面池失败异常'
    },
    130002: {
        desc: '池容量越界异常'
    },
    130003: {
        desc: '池容量不足异常'
    },
    130004: {
        desc: '桌面池创建桌面失败异常'
    },
    130005: {
        desc: '更新桌面池失败异常'
    },
    130006: {
        desc: '数据未找到异常'
    },
    130007: {
        desc: '调整桌面池失败异常'
    },
    130008: {
        desc: '发送消息到cm异常'
    },
    130009: {
        desc: '发送升级消息到用户异常'
    },
    170001: {
        desc: 'osquery查询异常'
    },
    170201: {
        desc: '新建联系人参数异常'
    },
    170202: {
        desc: '联系人信息（手机号，邮箱）冲突异常'
    },
    170203: {
        desc: '查询该联系人关联的告警策略异常'
    },
    170204: {
        desc: '发送测试邮件异常 '
    },
    170301: {
        desc: '告警规则同步异常'
    },
    170302: {
        desc: '获取物理机列表异常'
    },
    170303: {
        desc: '删除同步到zabbix上的告警规则异常'
    },
    170304: {
        desc: '获取主机监控项异常'
    },
    170401: {
        desc: '添加告警自动处理信息失败'
    },
    170402: {
        desc: '更新告警自动处理信息失败'
    },
    170403: {
        desc: '获取告警自动处理信息失败'
    },
    170404: {
        desc: '获取告警信息列表失败'
    },
    150001: {
        desc: '新建策略异常'
    },
    150002: {
        desc: '获取用户策略异常'
    },
    150003: {
        desc: '给用户或用户组重复添加策略异常'
    },
    150004: {
        desc: '新建策略异常'
    },
    150005: {
        desc: '获取策略列表异常'
    },
    150006: {
        desc: '获取策略详情异常'
    },
    150007: {
        desc: '获取例外设备列表异常'
    },
    150008: {
        desc: '删除某一例外设备异常'
    },
    150009: {
        desc: '编辑例外设备异常'
    },
    150010: {
        desc: '获取例外设备详情异常'
    },
    150011: {
        desc: '添加例外设备异常'
    },
    150012: {
        desc: '删除策略异常'
    },
    150013: {
        desc: '删除策略初始数据异常'
    },
    150201: {
        desc: '参数异常'
    },
    150202: {
        desc: '用户登录名重复异常'
    },
    150203: {
        desc: '用户组不存在异常'
    },
    150204: {
        desc: '更改用户参数异常'
    },
    150205: {
        desc: '重置密码参数异常'
    },
    150206: {
        desc: '用户不存在异常'
    },
    150207: {
        desc: '密码存在非法字符异常'
    },
    150208: {
        desc: '登录密码不合法异常'
    },
    150209: {
        desc: '外部域用户禁止修改密码'
    },
    150210: {
        desc: '新密码与原密码相同异常'
    },
    150211: {
        desc: 'list用户异常'
    },
    150212: {
        desc: '用户不存在异常'
    },
    150213: {
        desc: '用户登录参数异常'
    },
    150214: {
        desc: 'excel表格格式错误异常'
    },
    150215: {
        desc: '获取用户组失败异常'
    },
    150216: {
        // desc: '用户未找到异常'
        desc: '桌面绑定端口异常'
    },
    150217: {
        desc: '不允许修改用户组异常'
    },
    150218: {
        desc: '终端已有用户绑定异常'
    },
    150219: {
        desc: '获取终端列表异常'
    },
    150301: {
        desc: '用户组新增异常'
    },
    150302: {
        desc: '用户组更新异常'
    },
    150303: {
        desc: '删除用户组异常'
    },
    150304: {
        desc: '用户组初始数据删除异常'
    },
    150305: {
        desc: '获取用户组下的用户列表异常'
    },
    150306: {
        desc: '获取用户组列表异常'
    },
    150307: {
        desc: '获取某一用户组详情异常'
    },
    180101: {
        desc: '任务状态异常'
    },
    180101: {
        desc: '任务状态异常'
    },
    190101: {
        desc: '参数异常'
    },
    190102: {
        desc: '域已存在异常'
    },
    190103: {
        desc: '数据库操作异常'
    },
    190104: {
        desc: '域中已导入用户或用户组，无法删除'
    },
    190105: {
        desc: '用户或用户组已导入异常'
    },
    190106: {
        desc: '连接LDAP服务器异常'
    },
    190107: {
        desc: '用户绑定LDAP服务器时异常'
    },
    190108: {
        desc: '域导入时所选择用户组异常'
    },
    190108: {
        desc: '域导入时所选择用户组异常'
    },
    190108: {
        desc: '域导入时所选择用户组异常'
    },
    190108: {
        desc: '域导入时所选择用户组异常'
    },
    190201: {
        desc: '密码不匹配异常'
    },
    190202: {
        desc: '用户被禁用异常'
    },
    190203: {
        desc: '用户不存在异常'
    },
    190204: {
        desc: '原密码不匹配异常'
    },
    190205: {
        desc: '新密码不符合密码规则异常'
    },
    160001: {
        desc: '在表中查找不到数据异常'
    },
    160001: {
        desc: '在表中查找不到数据异常'
    },
    160001: {
        desc: '在表中查找不到数据异常'
    },
    160101: {
        desc: '设置密码规则参数异常'
    },
    160102: {
        desc: '密码最大长度不合法'
    },
    160103: {
        desc: '密码最小长度不合法'
    },
    160104: {
        desc: '密码首字母必须以大写开始异常'
    },
    160105: {
        desc: '密码必须包含特殊字符异常'
    },
    160106: {
        desc: '密码必须包含字符异常'
    },
    160107: {
        desc: '密码必须包含字符和特殊字符异常'
    },
    160108: {
        desc: '密码必须包含数字异常'
    },
    160109: {
        desc: '密码必须包含数字和特殊字符异常'
    },
    160110: {
        desc: '密码必须包含数字和字符异常'
    },
    160111: {
        desc: '密码必须包含数字,字符和特殊字符异常'
    },
    160201: {
        desc: '获取 modules 版本信息发生异常'
    },
    160202: {
        desc: '获取版本信息发生异常'
    },
    160301: {
        desc: '修改公网端口信息异常'
    },
    160302: {
        desc: '获取公网端口信息异常'
    },
    171001: {
        desc: '参数type的类型不是 OplogType异常'
    },
    112001: {
        desc: '修改失败'
    }
}

let COMMONCODE = {
    9000: {
        desc: 'jsonapi异常'
    },
    9001: {
        desc: 'sqlalchemy异常'
    },
    9003: {
        desc: '找不到auth'
    },
    9004: {
        desc: '找不到endpoint异常'
    },
    9005: {
        detail: '找不到header',
        desc: '找不到header 异常'
    },
    9006: {
        desc: 'Token认证失败'
    },
    9007: {
        desc: 'Token过期'
    },
    9008: {
        desc: '参数值为空异常'
    },
    9009: {
        desc: '必传参数缺失异常'
    },
    9010: {
        desc: '参数冲突异常'
    },
    9011: {
        desc: '预初始数据删除异常'
    },
    9012: {
        desc: '资源不存在异常'
    }
}

export default Object.assign({}, EVMCODE, XVIEWCODE, COMMONCODE)